RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/lcd_reg.h
     * |        |          |the pixel SEG30-COM0 is light (LCD_DATA07[16] = 0),
     * |        |          |the pixel SEG30-COM1 is dark (LCD_DATA07[17] = 1),
     * |        |          |the pixel SEG30-COM2 is dark (LCD_DATA07[18] = 1),
     * |        |          |the pixel SEG30-COM3 is light (LCD_DATA07[19] = 0),
     * |        |          |LCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.
     * |[31:24] |DD3       |Display Data of Segments S, where S is (4 x N) + 3, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD3 corresponds to SEG03, SEG07, SEG11, SEG15, SEG19, SEG23, SEG27, SEG31, SEG35, SEG39, and SEG43.
     * |        |          |Note 2: Each bit, DD3[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD3 (= LCD_DATA07[31:24]) = 1001_0110, LCD_DATA07[31:24] corresponds to SEG31 (4 x 7 + 3 = 31),
     * |        |          |the pixel SEG31-COM0 is light (LCD_DATA07[24] = 0),
     * |        |          |the pixel SEG31-COM1 is dark (LCD_DATA07[25] = 1),
     * |        |          |the pixel SEG31-COM2 is dark (LCD_DATA07[26] = 1),
     * |        |          |the pixel SEG31-COM3 is light (LCD_DATA07[27] = 0),
     * |        |          |LCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.
     * Offset: 0x28  LCD Segment Display Data Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |DD0       |Display Data of Segments S, where S is (4 x N) + 0, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD0 corresponds to SEG00, SEG04, SEG08, SEG12, SEG16, SEG20, SEG24, SEG28, SEG32, SEG36, and SEG40.
     * |        |          |Note 2: Each bit, DD0[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD0 (= LCD_DATA07[7:0]) = 1001_0110, LCD_DATA07[7:0] corresponds to SEG28 (4 x 7 + 0 = 28),
     * |        |          |the pixel SEG28-COM0 is light (LCD_DATA07[0] = 0),
     * |        |          |the pixel SEG28-COM1 is dark (LCD_DATA07[1] = 1),
     * |        |          |the pixel SEG28-COM2 is dark (LCD_DATA07[2] = 1),
     * |        |          |the pixel SEG28-COM3 is light (LCD_DATA07[3] = 0),
     * |        |          |LCD_DATA07[7:4] are ignored, since COMs from 4 to 7 are not used.
     * |[15:8]  |DD1       |Display Data of Segments S, where S is (4 x N) + 1, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD1 corresponds to SEG01, SEG05, SEG09, SEG13, SEG17, SEG21, SEG25, SEG29, SEG33, SEG37, and SEG41.
     * |        |          |Note 2: Each bit, DD1[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD1 (= LCD_DATA07[15:8]) = 1001_0110, LCD_DATA07[15:8] corresponds to SEG29 (4 x 7 + 1 = 29),
     * |        |          |the pixel SEG29-COM0 is light (LCD_DATA07[8] = 0),
     * |        |          |the pixel SEG29-COM1 is dark (LCD_DATA07[9] = 1),
     * |        |          |the pixel SEG29-COM2 is dark (LCD_DATA07[10] = 1),
     * |        |          |the pixel SEG29-COM3 is light (LCD_DATA07[11] = 0),
     * |        |          |LCD_DATA07[15:12] are ignored, since COMs from 4 to 7 are not used.
     * |[23:16] |DD2       |Display Data of Segments S, where S is (4 x N) + 2, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD2 corresponds to SEG02, SEG06, SEG10, SEG14, SEG18, SEG22, SEG26, SEG30, SEG34, SEG38, and SEG42.
     * |        |          |Note 2: Each bit, DD2[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD2 (= LCD_DATA07[23:16]) = 1001_0110, LCD_DATA07[23:16] corresponds to SEG31 (4 x 7 + 2 = 30),
     * |        |          |the pixel SEG30-COM0 is light (LCD_DATA07[16] = 0),
     * |        |          |the pixel SEG30-COM1 is dark (LCD_DATA07[17] = 1),
     * |        |          |the pixel SEG30-COM2 is dark (LCD_DATA07[18] = 1),
     * |        |          |the pixel SEG30-COM3 is light (LCD_DATA07[19] = 0),
     * |        |          |LCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.
     * |[31:24] |DD3       |Display Data of Segments S, where S is (4 x N) + 3, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD3 corresponds to SEG03, SEG07, SEG11, SEG15, SEG19, SEG23, SEG27, SEG31, SEG35, SEG39, and SEG43.
     * |        |          |Note 2: Each bit, DD3[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD3 (= LCD_DATA07[31:24]) = 1001_0110, LCD_DATA07[31:24] corresponds to SEG31 (4 x 7 + 3 = 31),
     * |        |          |the pixel SEG31-COM0 is light (LCD_DATA07[24] = 0),
     * |        |          |the pixel SEG31-COM1 is dark (LCD_DATA07[25] = 1),
     * |        |          |the pixel SEG31-COM2 is dark (LCD_DATA07[26] = 1),
     * |        |          |the pixel SEG31-COM3 is light (LCD_DATA07[27] = 0),
     * |        |          |LCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.
     * Offset: 0x2C  LCD Segment Display Data Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |DD0       |Display Data of Segments S, where S is (4 x N) + 0, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD0 corresponds to SEG00, SEG04, SEG08, SEG12, SEG16, SEG20, SEG24, SEG28, SEG32, SEG36, and SEG40.
     * |        |          |Note 2: Each bit, DD0[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD0 (= LCD_DATA07[7:0]) = 1001_0110, LCD_DATA07[7:0] corresponds to SEG28 (4 x 7 + 0 = 28),
     * |        |          |the pixel SEG28-COM0 is light (LCD_DATA07[0] = 0),
     * |        |          |the pixel SEG28-COM1 is dark (LCD_DATA07[1] = 1),
     * |        |          |the pixel SEG28-COM2 is dark (LCD_DATA07[2] = 1),
     * |        |          |the pixel SEG28-COM3 is light (LCD_DATA07[3] = 0),
     * |        |          |LCD_DATA07[7:4] are ignored, since COMs from 4 to 7 are not used.
     * |[15:8]  |DD1       |Display Data of Segments S, where S is (4 x N) + 1, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD1 corresponds to SEG01, SEG05, SEG09, SEG13, SEG17, SEG21, SEG25, SEG29, SEG33, SEG37, and SEG41.
     * |        |          |Note 2: Each bit, DD1[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD1 (= LCD_DATA07[15:8]) = 1001_0110, LCD_DATA07[15:8] corresponds to SEG29 (4 x 7 + 1 = 29),
     * |        |          |the pixel SEG29-COM0 is light (LCD_DATA07[8] = 0),
     * |        |          |the pixel SEG29-COM1 is dark (LCD_DATA07[9] = 1),
     * |        |          |the pixel SEG29-COM2 is dark (LCD_DATA07[10] = 1),
     * |        |          |the pixel SEG29-COM3 is light (LCD_DATA07[11] = 0),
     * |        |          |LCD_DATA07[15:12] are ignored, since COMs from 4 to 7 are not used.
     * |[23:16] |DD2       |Display Data of Segments S, where S is (4 x N) + 2, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD2 corresponds to SEG02, SEG06, SEG10, SEG14, SEG18, SEG22, SEG26, SEG30, SEG34, SEG38, and SEG42.
     * |        |          |Note 2: Each bit, DD2[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD2 (= LCD_DATA07[23:16]) = 1001_0110, LCD_DATA07[23:16] corresponds to SEG31 (4 x 7 + 2 = 30),
     * |        |          |the pixel SEG30-COM0 is light (LCD_DATA07[16] = 0),
     * |        |          |the pixel SEG30-COM1 is dark (LCD_DATA07[17] = 1),
     * |        |          |the pixel SEG30-COM2 is dark (LCD_DATA07[18] = 1),
     * |        |          |the pixel SEG30-COM3 is light (LCD_DATA07[19] = 0),
     * |        |          |LCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.
     * |[31:24] |DD3       |Display Data of Segments S, where S is (4 x N) + 3, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD3 corresponds to SEG03, SEG07, SEG11, SEG15, SEG19, SEG23, SEG27, SEG31, SEG35, SEG39, and SEG43.
     * |        |          |Note 2: Each bit, DD3[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD3 (= LCD_DATA07[31:24]) = 1001_0110, LCD_DATA07[31:24] corresponds to SEG31 (4 x 7 + 3 = 31),
     * |        |          |the pixel SEG31-COM0 is light (LCD_DATA07[24] = 0),
     * |        |          |the pixel SEG31-COM1 is dark (LCD_DATA07[25] = 1),
     * |        |          |the pixel SEG31-COM2 is dark (LCD_DATA07[26] = 1),
     * |        |          |the pixel SEG31-COM3 is light (LCD_DATA07[27] = 0),
     * |        |          |LCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.
     * Offset: 0x30  LCD Segment Display Data Register 4
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |DD0       |Display Data of Segments S, where S is (4 x N) + 0, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD0 corresponds to SEG00, SEG04, SEG08, SEG12, SEG16, SEG20, SEG24, SEG28, SEG32, SEG36, and SEG40.
     * |        |          |Note 2: Each bit, DD0[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD0 (= LCD_DATA07[7:0]) = 1001_0110, LCD_DATA07[7:0] corresponds to SEG28 (4 x 7 + 0 = 28),
     * |        |          |the pixel SEG28-COM0 is light (LCD_DATA07[0] = 0),
     * |        |          |the pixel SEG28-COM1 is dark (LCD_DATA07[1] = 1),
     * |        |          |the pixel SEG28-COM2 is dark (LCD_DATA07[2] = 1),
     * |        |          |the pixel SEG28-COM3 is light (LCD_DATA07[3] = 0),
     * |        |          |LCD_DATA07[7:4] are ignored, since COMs from 4 to 7 are not used.
     * |[15:8]  |DD1       |Display Data of Segments S, where S is (4 x N) + 1, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD1 corresponds to SEG01, SEG05, SEG09, SEG13, SEG17, SEG21, SEG25, SEG29, SEG33, SEG37, and SEG41.
     * |        |          |Note 2: Each bit, DD1[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD1 (= LCD_DATA07[15:8]) = 1001_0110, LCD_DATA07[15:8] corresponds to SEG29 (4 x 7 + 1 = 29),
     * |        |          |the pixel SEG29-COM0 is light (LCD_DATA07[8] = 0),
     * |        |          |the pixel SEG29-COM1 is dark (LCD_DATA07[9] = 1),
     * |        |          |the pixel SEG29-COM2 is dark (LCD_DATA07[10] = 1),
     * |        |          |the pixel SEG29-COM3 is light (LCD_DATA07[11] = 0),
     * |        |          |LCD_DATA07[15:12] are ignored, since COMs from 4 to 7 are not used.
     * |[23:16] |DD2       |Display Data of Segments S, where S is (4 x N) + 2, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD2 corresponds to SEG02, SEG06, SEG10, SEG14, SEG18, SEG22, SEG26, SEG30, SEG34, SEG38, and SEG42.
     * |        |          |Note 2: Each bit, DD2[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD2 (= LCD_DATA07[23:16]) = 1001_0110, LCD_DATA07[23:16] corresponds to SEG31 (4 x 7 + 2 = 30),
     * |        |          |the pixel SEG30-COM0 is light (LCD_DATA07[16] = 0),
     * |        |          |the pixel SEG30-COM1 is dark (LCD_DATA07[17] = 1),
     * |        |          |the pixel SEG30-COM2 is dark (LCD_DATA07[18] = 1),
     * |        |          |the pixel SEG30-COM3 is light (LCD_DATA07[19] = 0),
     * |        |          |LCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.
     * |[31:24] |DD3       |Display Data of Segments S, where S is (4 x N) + 3, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD3 corresponds to SEG03, SEG07, SEG11, SEG15, SEG19, SEG23, SEG27, SEG31, SEG35, SEG39, and SEG43.
     * |        |          |Note 2: Each bit, DD3[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD3 (= LCD_DATA07[31:24]) = 1001_0110, LCD_DATA07[31:24] corresponds to SEG31 (4 x 7 + 3 = 31),
     * |        |          |the pixel SEG31-COM0 is light (LCD_DATA07[24] = 0),
     * |        |          |the pixel SEG31-COM1 is dark (LCD_DATA07[25] = 1),
     * |        |          |the pixel SEG31-COM2 is dark (LCD_DATA07[26] = 1),
     * |        |          |the pixel SEG31-COM3 is light (LCD_DATA07[27] = 0),
     * |        |          |LCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.
     * Offset: 0x34  LCD Segment Display Data Register 5
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |DD0       |Display Data of Segments S, where S is (4 x N) + 0, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD0 corresponds to SEG00, SEG04, SEG08, SEG12, SEG16, SEG20, SEG24, SEG28, SEG32, SEG36, and SEG40.
     * |        |          |Note 2: Each bit, DD0[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD0 (= LCD_DATA07[7:0]) = 1001_0110, LCD_DATA07[7:0] corresponds to SEG28 (4 x 7 + 0 = 28),
     * |        |          |the pixel SEG28-COM0 is light (LCD_DATA07[0] = 0),
     * |        |          |the pixel SEG28-COM1 is dark (LCD_DATA07[1] = 1),
     * |        |          |the pixel SEG28-COM2 is dark (LCD_DATA07[2] = 1),
     * |        |          |the pixel SEG28-COM3 is light (LCD_DATA07[3] = 0),
     * |        |          |LCD_DATA07[7:4] are ignored, since COMs from 4 to 7 are not used.
     * |[15:8]  |DD1       |Display Data of Segments S, where S is (4 x N) + 1, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD1 corresponds to SEG01, SEG05, SEG09, SEG13, SEG17, SEG21, SEG25, SEG29, SEG33, SEG37, and SEG41.
     * |        |          |Note 2: Each bit, DD1[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD1 (= LCD_DATA07[15:8]) = 1001_0110, LCD_DATA07[15:8] corresponds to SEG29 (4 x 7 + 1 = 29),
     * |        |          |the pixel SEG29-COM0 is light (LCD_DATA07[8] = 0),
     * |        |          |the pixel SEG29-COM1 is dark (LCD_DATA07[9] = 1),
     * |        |          |the pixel SEG29-COM2 is dark (LCD_DATA07[10] = 1),
     * |        |          |the pixel SEG29-COM3 is light (LCD_DATA07[11] = 0),
     * |        |          |LCD_DATA07[15:12] are ignored, since COMs from 4 to 7 are not used.
     * |[23:16] |DD2       |Display Data of Segments S, where S is (4 x N) + 2, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD2 corresponds to SEG02, SEG06, SEG10, SEG14, SEG18, SEG22, SEG26, SEG30, SEG34, SEG38, and SEG42.
     * |        |          |Note 2: Each bit, DD2[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD2 (= LCD_DATA07[23:16]) = 1001_0110, LCD_DATA07[23:16] corresponds to SEG31 (4 x 7 + 2 = 30),
     * |        |          |the pixel SEG30-COM0 is light (LCD_DATA07[16] = 0),
     * |        |          |the pixel SEG30-COM1 is dark (LCD_DATA07[17] = 1),
     * |        |          |the pixel SEG30-COM2 is dark (LCD_DATA07[18] = 1),
     * |        |          |the pixel SEG30-COM3 is light (LCD_DATA07[19] = 0),
     * |        |          |LCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.
     * |[31:24] |DD3       |Display Data of Segments S, where S is (4 x N) + 3, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD3 corresponds to SEG03, SEG07, SEG11, SEG15, SEG19, SEG23, SEG27, SEG31, SEG35, SEG39, and SEG43.
     * |        |          |Note 2: Each bit, DD3[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD3 (= LCD_DATA07[31:24]) = 1001_0110, LCD_DATA07[31:24] corresponds to SEG31 (4 x 7 + 3 = 31),
     * |        |          |the pixel SEG31-COM0 is light (LCD_DATA07[24] = 0),
     * |        |          |the pixel SEG31-COM1 is dark (LCD_DATA07[25] = 1),
     * |        |          |the pixel SEG31-COM2 is dark (LCD_DATA07[26] = 1),
     * |        |          |the pixel SEG31-COM3 is light (LCD_DATA07[27] = 0),
     * |        |          |LCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.
     * Offset: 0x38  LCD Segment Display Data Register 6
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |DD0       |Display Data of Segments S, where S is (4 x N) + 0, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD0 corresponds to SEG00, SEG04, SEG08, SEG12, SEG16, SEG20, SEG24, SEG28, SEG32, SEG36, and SEG40.
     * |        |          |Note 2: Each bit, DD0[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD0 (= LCD_DATA07[7:0]) = 1001_0110, LCD_DATA07[7:0] corresponds to SEG28 (4 x 7 + 0 = 28),
     * |        |          |the pixel SEG28-COM0 is light (LCD_DATA07[0] = 0),
     * |        |          |the pixel SEG28-COM1 is dark (LCD_DATA07[1] = 1),
     * |        |          |the pixel SEG28-COM2 is dark (LCD_DATA07[2] = 1),
     * |        |          |the pixel SEG28-COM3 is light (LCD_DATA07[3] = 0),
     * |        |          |LCD_DATA07[7:4] are ignored, since COMs from 4 to 7 are not used.
     * |[15:8]  |DD1       |Display Data of Segments S, where S is (4 x N) + 1, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD1 corresponds to SEG01, SEG05, SEG09, SEG13, SEG17, SEG21, SEG25, SEG29, SEG33, SEG37, and SEG41.
     * |        |          |Note 2: Each bit, DD1[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD1 (= LCD_DATA07[15:8]) = 1001_0110, LCD_DATA07[15:8] corresponds to SEG29 (4 x 7 + 1 = 29),
     * |        |          |the pixel SEG29-COM0 is light (LCD_DATA07[8] = 0),
     * |        |          |the pixel SEG29-COM1 is dark (LCD_DATA07[9] = 1),
     * |        |          |the pixel SEG29-COM2 is dark (LCD_DATA07[10] = 1),
     * |        |          |the pixel SEG29-COM3 is light (LCD_DATA07[11] = 0),
     * |        |          |LCD_DATA07[15:12] are ignored, since COMs from 4 to 7 are not used.
     * |[23:16] |DD2       |Display Data of Segments S, where S is (4 x N) + 2, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD2 corresponds to SEG02, SEG06, SEG10, SEG14, SEG18, SEG22, SEG26, SEG30, SEG34, SEG38, and SEG42.
     * |        |          |Note 2: Each bit, DD2[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD2 (= LCD_DATA07[23:16]) = 1001_0110, LCD_DATA07[23:16] corresponds to SEG31 (4 x 7 + 2 = 30),
     * |        |          |the pixel SEG30-COM0 is light (LCD_DATA07[16] = 0),
     * |        |          |the pixel SEG30-COM1 is dark (LCD_DATA07[17] = 1),
     * |        |          |the pixel SEG30-COM2 is dark (LCD_DATA07[18] = 1),
     * |        |          |the pixel SEG30-COM3 is light (LCD_DATA07[19] = 0),
     * |        |          |LCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.
     * |[31:24] |DD3       |Display Data of Segments S, where S is (4 x N) + 3, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD3 corresponds to SEG03, SEG07, SEG11, SEG15, SEG19, SEG23, SEG27, SEG31, SEG35, SEG39, and SEG43.
     * |        |          |Note 2: Each bit, DD3[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD3 (= LCD_DATA07[31:24]) = 1001_0110, LCD_DATA07[31:24] corresponds to SEG31 (4 x 7 + 3 = 31),
