RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/lcd_reg.h
     * |        |          |the pixel SEG31-COM0 is light (LCD_DATA07[24] = 0),
     * |        |          |the pixel SEG31-COM1 is dark (LCD_DATA07[25] = 1),
     * |        |          |the pixel SEG31-COM2 is dark (LCD_DATA07[26] = 1),
     * |        |          |the pixel SEG31-COM3 is light (LCD_DATA07[27] = 0),
     * |        |          |LCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.
     * Offset: 0x3C  LCD Segment Display Data Register 7
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |DD0       |Display Data of Segments S, where S is (4 x N) + 0, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD0 corresponds to SEG00, SEG04, SEG08, SEG12, SEG16, SEG20, SEG24, SEG28, SEG32, SEG36, and SEG40.
     * |        |          |Note 2: Each bit, DD0[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD0 (= LCD_DATA07[7:0]) = 1001_0110, LCD_DATA07[7:0] corresponds to SEG28 (4 x 7 + 0 = 28),
     * |        |          |the pixel SEG28-COM0 is light (LCD_DATA07[0] = 0),
     * |        |          |the pixel SEG28-COM1 is dark (LCD_DATA07[1] = 1),
     * |        |          |the pixel SEG28-COM2 is dark (LCD_DATA07[2] = 1),
     * |        |          |the pixel SEG28-COM3 is light (LCD_DATA07[3] = 0),
     * |        |          |LCD_DATA07[7:4] are ignored, since COMs from 4 to 7 are not used.
     * |[15:8]  |DD1       |Display Data of Segments S, where S is (4 x N) + 1, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD1 corresponds to SEG01, SEG05, SEG09, SEG13, SEG17, SEG21, SEG25, SEG29, SEG33, SEG37, and SEG41.
     * |        |          |Note 2: Each bit, DD1[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD1 (= LCD_DATA07[15:8]) = 1001_0110, LCD_DATA07[15:8] corresponds to SEG29 (4 x 7 + 1 = 29),
     * |        |          |the pixel SEG29-COM0 is light (LCD_DATA07[8] = 0),
     * |        |          |the pixel SEG29-COM1 is dark (LCD_DATA07[9] = 1),
     * |        |          |the pixel SEG29-COM2 is dark (LCD_DATA07[10] = 1),
     * |        |          |the pixel SEG29-COM3 is light (LCD_DATA07[11] = 0),
     * |        |          |LCD_DATA07[15:12] are ignored, since COMs from 4 to 7 are not used.
     * |[23:16] |DD2       |Display Data of Segments S, where S is (4 x N) + 2, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD2 corresponds to SEG02, SEG06, SEG10, SEG14, SEG18, SEG22, SEG26, SEG30, SEG34, SEG38, and SEG42.
     * |        |          |Note 2: Each bit, DD2[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD2 (= LCD_DATA07[23:16]) = 1001_0110, LCD_DATA07[23:16] corresponds to SEG31 (4 x 7 + 2 = 30),
     * |        |          |the pixel SEG30-COM0 is light (LCD_DATA07[16] = 0),
     * |        |          |the pixel SEG30-COM1 is dark (LCD_DATA07[17] = 1),
     * |        |          |the pixel SEG30-COM2 is dark (LCD_DATA07[18] = 1),
     * |        |          |the pixel SEG30-COM3 is light (LCD_DATA07[19] = 0),
     * |        |          |LCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.
     * |[31:24] |DD3       |Display Data of Segments S, where S is (4 x N) + 3, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD3 corresponds to SEG03, SEG07, SEG11, SEG15, SEG19, SEG23, SEG27, SEG31, SEG35, SEG39, and SEG43.
     * |        |          |Note 2: Each bit, DD3[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD3 (= LCD_DATA07[31:24]) = 1001_0110, LCD_DATA07[31:24] corresponds to SEG31 (4 x 7 + 3 = 31),
     * |        |          |the pixel SEG31-COM0 is light (LCD_DATA07[24] = 0),
     * |        |          |the pixel SEG31-COM1 is dark (LCD_DATA07[25] = 1),
     * |        |          |the pixel SEG31-COM2 is dark (LCD_DATA07[26] = 1),
     * |        |          |the pixel SEG31-COM3 is light (LCD_DATA07[27] = 0),
     * |        |          |LCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.
     * Offset: 0x40  LCD Segment Display Data Register 8
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |DD0       |Display Data of Segments S, where S is (4 x N) + 0, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD0 corresponds to SEG00, SEG04, SEG08, SEG12, SEG16, SEG20, SEG24, SEG28, SEG32, SEG36, and SEG40.
     * |        |          |Note 2: Each bit, DD0[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD0 (= LCD_DATA07[7:0]) = 1001_0110, LCD_DATA07[7:0] corresponds to SEG28 (4 x 7 + 0 = 28),
     * |        |          |the pixel SEG28-COM0 is light (LCD_DATA07[0] = 0),
     * |        |          |the pixel SEG28-COM1 is dark (LCD_DATA07[1] = 1),
     * |        |          |the pixel SEG28-COM2 is dark (LCD_DATA07[2] = 1),
     * |        |          |the pixel SEG28-COM3 is light (LCD_DATA07[3] = 0),
     * |        |          |LCD_DATA07[7:4] are ignored, since COMs from 4 to 7 are not used.
     * |[15:8]  |DD1       |Display Data of Segments S, where S is (4 x N) + 1, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD1 corresponds to SEG01, SEG05, SEG09, SEG13, SEG17, SEG21, SEG25, SEG29, SEG33, SEG37, and SEG41.
     * |        |          |Note 2: Each bit, DD1[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD1 (= LCD_DATA07[15:8]) = 1001_0110, LCD_DATA07[15:8] corresponds to SEG29 (4 x 7 + 1 = 29),
     * |        |          |the pixel SEG29-COM0 is light (LCD_DATA07[8] = 0),
     * |        |          |the pixel SEG29-COM1 is dark (LCD_DATA07[9] = 1),
     * |        |          |the pixel SEG29-COM2 is dark (LCD_DATA07[10] = 1),
     * |        |          |the pixel SEG29-COM3 is light (LCD_DATA07[11] = 0),
     * |        |          |LCD_DATA07[15:12] are ignored, since COMs from 4 to 7 are not used.
     * |[23:16] |DD2       |Display Data of Segments S, where S is (4 x N) + 2, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD2 corresponds to SEG02, SEG06, SEG10, SEG14, SEG18, SEG22, SEG26, SEG30, SEG34, SEG38, and SEG42.
     * |        |          |Note 2: Each bit, DD2[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD2 (= LCD_DATA07[23:16]) = 1001_0110, LCD_DATA07[23:16] corresponds to SEG31 (4 x 7 + 2 = 30),
     * |        |          |the pixel SEG30-COM0 is light (LCD_DATA07[16] = 0),
     * |        |          |the pixel SEG30-COM1 is dark (LCD_DATA07[17] = 1),
     * |        |          |the pixel SEG30-COM2 is dark (LCD_DATA07[18] = 1),
     * |        |          |the pixel SEG30-COM3 is light (LCD_DATA07[19] = 0),
     * |        |          |LCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.
     * |[31:24] |DD3       |Display Data of Segments S, where S is (4 x N) + 3, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD3 corresponds to SEG03, SEG07, SEG11, SEG15, SEG19, SEG23, SEG27, SEG31, SEG35, SEG39, and SEG43.
     * |        |          |Note 2: Each bit, DD3[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD3 (= LCD_DATA07[31:24]) = 1001_0110, LCD_DATA07[31:24] corresponds to SEG31 (4 x 7 + 3 = 31),
     * |        |          |the pixel SEG31-COM0 is light (LCD_DATA07[24] = 0),
     * |        |          |the pixel SEG31-COM1 is dark (LCD_DATA07[25] = 1),
     * |        |          |the pixel SEG31-COM2 is dark (LCD_DATA07[26] = 1),
     * |        |          |the pixel SEG31-COM3 is light (LCD_DATA07[27] = 0),
     * |        |          |LCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.
     * Offset: 0x44  LCD Segment Display Data Register 9
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |DD0       |Display Data of Segments S, where S is (4 x N) + 0, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD0 corresponds to SEG00, SEG04, SEG08, SEG12, SEG16, SEG20, SEG24, SEG28, SEG32, SEG36, and SEG40.
     * |        |          |Note 2: Each bit, DD0[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD0 (= LCD_DATA07[7:0]) = 1001_0110, LCD_DATA07[7:0] corresponds to SEG28 (4 x 7 + 0 = 28),
     * |        |          |the pixel SEG28-COM0 is light (LCD_DATA07[0] = 0),
     * |        |          |the pixel SEG28-COM1 is dark (LCD_DATA07[1] = 1),
     * |        |          |the pixel SEG28-COM2 is dark (LCD_DATA07[2] = 1),
     * |        |          |the pixel SEG28-COM3 is light (LCD_DATA07[3] = 0),
     * |        |          |LCD_DATA07[7:4] are ignored, since COMs from 4 to 7 are not used.
     * |[15:8]  |DD1       |Display Data of Segments S, where S is (4 x N) + 1, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD1 corresponds to SEG01, SEG05, SEG09, SEG13, SEG17, SEG21, SEG25, SEG29, SEG33, SEG37, and SEG41.
     * |        |          |Note 2: Each bit, DD1[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD1 (= LCD_DATA07[15:8]) = 1001_0110, LCD_DATA07[15:8] corresponds to SEG29 (4 x 7 + 1 = 29),
     * |        |          |the pixel SEG29-COM0 is light (LCD_DATA07[8] = 0),
     * |        |          |the pixel SEG29-COM1 is dark (LCD_DATA07[9] = 1),
     * |        |          |the pixel SEG29-COM2 is dark (LCD_DATA07[10] = 1),
     * |        |          |the pixel SEG29-COM3 is light (LCD_DATA07[11] = 0),
     * |        |          |LCD_DATA07[15:12] are ignored, since COMs from 4 to 7 are not used.
     * |[23:16] |DD2       |Display Data of Segments S, where S is (4 x N) + 2, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD2 corresponds to SEG02, SEG06, SEG10, SEG14, SEG18, SEG22, SEG26, SEG30, SEG34, SEG38, and SEG42.
     * |        |          |Note 2: Each bit, DD2[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD2 (= LCD_DATA07[23:16]) = 1001_0110, LCD_DATA07[23:16] corresponds to SEG31 (4 x 7 + 2 = 30),
     * |        |          |the pixel SEG30-COM0 is light (LCD_DATA07[16] = 0),
     * |        |          |the pixel SEG30-COM1 is dark (LCD_DATA07[17] = 1),
     * |        |          |the pixel SEG30-COM2 is dark (LCD_DATA07[18] = 1),
     * |        |          |the pixel SEG30-COM3 is light (LCD_DATA07[19] = 0),
     * |        |          |LCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.
     * |[31:24] |DD3       |Display Data of Segments S, where S is (4 x N) + 3, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD3 corresponds to SEG03, SEG07, SEG11, SEG15, SEG19, SEG23, SEG27, SEG31, SEG35, SEG39, and SEG43.
     * |        |          |Note 2: Each bit, DD3[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD3 (= LCD_DATA07[31:24]) = 1001_0110, LCD_DATA07[31:24] corresponds to SEG31 (4 x 7 + 3 = 31),
     * |        |          |the pixel SEG31-COM0 is light (LCD_DATA07[24] = 0),
     * |        |          |the pixel SEG31-COM1 is dark (LCD_DATA07[25] = 1),
     * |        |          |the pixel SEG31-COM2 is dark (LCD_DATA07[26] = 1),
     * |        |          |the pixel SEG31-COM3 is light (LCD_DATA07[27] = 0),
     * |        |          |LCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.
     * Offset: 0x48  LCD Segment Display Data Register 10
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7:0]   |DD0       |Display Data of Segments S, where S is (4 x N) + 0, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD0 corresponds to SEG00, SEG04, SEG08, SEG12, SEG16, SEG20, SEG24, SEG28, SEG32, SEG36, and SEG40.
     * |        |          |Note 2: Each bit, DD0[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD0 (= LCD_DATA07[7:0]) = 1001_0110, LCD_DATA07[7:0] corresponds to SEG28 (4 x 7 + 0 = 28),
     * |        |          |the pixel SEG28-COM0 is light (LCD_DATA07[0] = 0),
     * |        |          |the pixel SEG28-COM1 is dark (LCD_DATA07[1] = 1),
     * |        |          |the pixel SEG28-COM2 is dark (LCD_DATA07[2] = 1),
     * |        |          |the pixel SEG28-COM3 is light (LCD_DATA07[3] = 0),
     * |        |          |LCD_DATA07[7:4] are ignored, since COMs from 4 to 7 are not used.
     * |[15:8]  |DD1       |Display Data of Segments S, where S is (4 x N) + 1, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD1 corresponds to SEG01, SEG05, SEG09, SEG13, SEG17, SEG21, SEG25, SEG29, SEG33, SEG37, and SEG41.
     * |        |          |Note 2: Each bit, DD1[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD1 (= LCD_DATA07[15:8]) = 1001_0110, LCD_DATA07[15:8] corresponds to SEG29 (4 x 7 + 1 = 29),
     * |        |          |the pixel SEG29-COM0 is light (LCD_DATA07[8] = 0),
     * |        |          |the pixel SEG29-COM1 is dark (LCD_DATA07[9] = 1),
     * |        |          |the pixel SEG29-COM2 is dark (LCD_DATA07[10] = 1),
     * |        |          |the pixel SEG29-COM3 is light (LCD_DATA07[11] = 0),
     * |        |          |LCD_DATA07[15:12] are ignored, since COMs from 4 to 7 are not used.
     * |[23:16] |DD2       |Display Data of Segments S, where S is (4 x N) + 2, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD2 corresponds to SEG02, SEG06, SEG10, SEG14, SEG18, SEG22, SEG26, SEG30, SEG34, SEG38, and SEG42.
     * |        |          |Note 2: Each bit, DD2[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD2 (= LCD_DATA07[23:16]) = 1001_0110, LCD_DATA07[23:16] corresponds to SEG31 (4 x 7 + 2 = 30),
     * |        |          |the pixel SEG30-COM0 is light (LCD_DATA07[16] = 0),
     * |        |          |the pixel SEG30-COM1 is dark (LCD_DATA07[17] = 1),
     * |        |          |the pixel SEG30-COM2 is dark (LCD_DATA07[18] = 1),
     * |        |          |the pixel SEG30-COM3 is light (LCD_DATA07[19] = 0),
     * |        |          |LCD_DATA07[23:20] are ignored, since COMs from 4 to 7 are not used.
     * |[31:24] |DD3       |Display Data of Segments S, where S is (4 x N) + 3, and N is 0, 1, 2, ..., 10
     * |        |          |Each bit specifies the brightness of each pixel in a segment.
     * |        |          |0 = The pixel is light
     * |        |          |1 = The pixel is dark
     * |        |          |Note 1: DD3 corresponds to SEG03, SEG07, SEG11, SEG15, SEG19, SEG23, SEG27, SEG31, SEG35, SEG39, and SEG43.
     * |        |          |Note 2: Each bit, DD3[n], corresponds to COMn, n= 0 ~ 7.
     * |        |          |[Example] Assume 1/4 Duty, and DD3 (= LCD_DATA07[31:24]) = 1001_0110, LCD_DATA07[31:24] corresponds to SEG31 (4 x 7 + 3 = 31),
     * |        |          |the pixel SEG31-COM0 is light (LCD_DATA07[24] = 0),
     * |        |          |the pixel SEG31-COM1 is dark (LCD_DATA07[25] = 1),
     * |        |          |the pixel SEG31-COM2 is dark (LCD_DATA07[26] = 1),
     * |        |          |the pixel SEG31-COM3 is light (LCD_DATA07[27] = 0),
     * |        |          |LCD_DATA07[31:28] are ignored, since COMs from 4 to 7 are not used.
     */
    __IO uint32_t CTL;                  /*!< [0x0000] LCD Control Register                                      */
    __IO uint32_t PCTL;                 /*!< [0x0004] LCD Panel Control Register                                */
    __IO uint32_t FCTL;                 /*!< [0x0008] LCD Frame Control Register                                */
    __IO uint32_t DCTL;                 /*!< [0x000C] LCD Driving Control Register                              */
    __IO uint32_t PKGSEL;               /*!< [0x0010] LCD Package Selection Register                            */
    __IO uint32_t STS;                  /*!< [0x0014] LCD Status Register                                       */
    __IO uint32_t INTEN;                /*!< [0x0018] LCD Interrupt Enable Register                             */
    __I  uint32_t RESERVED0;            /*!< [0x001C] Reserved 0                                                */
    __IO uint32_t DATA[11];             /*!< [0x0020] ~ [0x0048] LCD Segment Display Data Register 0 ~ 10       */

} LCD_T;

/**
    @addtogroup LCD_CONST LCD Bit Field Definition
    Constant Definitions for LCD Controller
  @{
*/

#define LCD_CTL_EN_Pos                  (0)                                                 /*!< LCD_T::CTL: EN Position                */
#define LCD_CTL_EN_Msk                  (0x1ul << LCD_CTL_EN_Pos)                           /*!< LCD_T::CTL: EN Mask                    */

#define LCD_CTL_SYNC_Pos                (31)                                                /*!< LCD_T::CTL: SYNC Position              */
#define LCD_CTL_SYNC_Msk                (0x1ul << LCD_CTL_SYNC_Pos)                         /*!< LCD_T::CTL: SYNC Mask                  */

