RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/lcd_reg.h
#define LCD_PCTL_BIAS_Pos               (0)                                                 /*!< LCD_T::PCTL: BIAS Position             */
#define LCD_PCTL_BIAS_Msk               (0x3ul << LCD_PCTL_BIAS_Pos)                        /*!< LCD_T::PCTL: BIAS Mask                 */

#define LCD_PCTL_DUTY_Pos               (2)                                                 /*!< LCD_T::PCTL: DUTY Position             */
#define LCD_PCTL_DUTY_Msk               (0x7ul << LCD_PCTL_DUTY_Pos)                        /*!< LCD_T::PCTL: DUTY Mask                 */

#define LCD_PCTL_TYPE_Pos               (5)                                                 /*!< LCD_T::PCTL: TYPE Position             */
#define LCD_PCTL_TYPE_Msk               (0x1ul << LCD_PCTL_TYPE_Pos)                        /*!< LCD_T::PCTL: TYPE Mask                 */

#define LCD_PCTL_INV_Pos                (6)                                                 /*!< LCD_T::PCTL: INV Position              */
#define LCD_PCTL_INV_Msk                (0x1ul << LCD_PCTL_INV_Pos)                         /*!< LCD_T::PCTL: INV Mask                  */

#define LCD_PCTL_FREQDIV_Pos            (8)                                                 /*!< LCD_T::PCTL: FREQDIV Position          */
#define LCD_PCTL_FREQDIV_Msk            (0x3fful << LCD_PCTL_FREQDIV_Pos)                   /*!< LCD_T::PCTL: FREQDIV Mask              */

#define LCD_PCTL_CPVSEL_Pos             (18)                                                /*!< LCD_T::PCTL: CPVSEL Position           */
#define LCD_PCTL_CPVSEL_Msk             (0x7ul << LCD_PCTL_CPVSEL_Pos)                      /*!< LCD_T::PCTL: CPVSEL Mask               */

#define LCD_PCTL_CPVTUNE_Pos            (24)                                                /*!< LCD_T::PCTL: CPVTUNE Position          */
#define LCD_PCTL_CPVTUNE_Msk            (0xful << LCD_PCTL_CPVTUNE_Pos)                     /*!< LCD_T::PCTL: CPVTUNE Mask              */

#define LCD_FCTL_BLINK_Pos              (0)                                                 /*!< LCD_T::FCTL: BLINK Position            */
#define LCD_FCTL_BLINK_Msk              (0x1ul << LCD_FCTL_BLINK_Pos)                       /*!< LCD_T::FCTL: BLINK Mask                */

#define LCD_FCTL_FCV_Pos                (8)                                                 /*!< LCD_T::FCTL: FCV Position              */
#define LCD_FCTL_FCV_Msk                (0x3fful << LCD_FCTL_FCV_Pos)                       /*!< LCD_T::FCTL: FCV Mask                  */

#define LCD_FCTL_NFTIME_Pos             (24)                                                /*!< LCD_T::FCTL: NFTIME Position           */
#define LCD_FCTL_NFTIME_Msk             (0xful << LCD_FCTL_NFTIME_Pos)                      /*!< LCD_T::FCTL: NFTIME Mask               */

#define LCD_FCTL_NFNUM_Pos              (28)                                                /*!< LCD_T::FCTL: NFNUM Position            */
#define LCD_FCTL_NFNUM_Msk              (0xful << LCD_FCTL_NFNUM_Pos)                       /*!< LCD_T::FCTL: NFNUM Mask                */

#define LCD_DCTL_VSRC_Pos               (0)                                                 /*!< LCD_T::DCTL: VSRC Position             */
#define LCD_DCTL_VSRC_Msk               (0x3ul << LCD_DCTL_VSRC_Pos)                        /*!< LCD_T::DCTL: VSRC Mask                 */

#define LCD_DCTL_RESMODE_Pos            (2)                                                 /*!< LCD_T::DCTL: RESMODE Position          */
#define LCD_DCTL_RESMODE_Msk            (0x1ul << LCD_DCTL_RESMODE_Pos)                     /*!< LCD_T::DCTL: RESMODE Mask              */

#define LCD_DCTL_BUFEN_Pos              (3)                                                 /*!< LCD_T::DCTL: BUFEN Position            */
#define LCD_DCTL_BUFEN_Msk              (0x1ul << LCD_DCTL_BUFEN_Pos)                       /*!< LCD_T::DCTL: BUFEN Mask                */

#define LCD_DCTL_PSVEN_Pos              (4)                                                 /*!< LCD_T::DCTL: PSVEN Position            */
#define LCD_DCTL_PSVEN_Msk              (0x1ul << LCD_DCTL_PSVEN_Pos)                       /*!< LCD_T::DCTL: PSVEN Mask                */

#define LCD_DCTL_PSVREV_Pos             (5)                                                 /*!< LCD_T::DCTL: PSVREV Position           */
#define LCD_DCTL_PSVREV_Msk             (0x1ul << LCD_DCTL_PSVREV_Pos)                      /*!< LCD_T::DCTL: PSVREV Mask               */

#define LCD_DCTL_PSVT1_Pos              (8)                                                 /*!< LCD_T::DCTL: PSVT1 Position            */
#define LCD_DCTL_PSVT1_Msk              (0xful << LCD_DCTL_PSVT1_Pos)                       /*!< LCD_T::DCTL: PSVT1 Mask                */

#define LCD_DCTL_PSVT2_Pos              (12)                                                /*!< LCD_T::DCTL: PSVT2 Position            */
#define LCD_DCTL_PSVT2_Msk              (0xful << LCD_DCTL_PSVT2_Pos)                       /*!< LCD_T::DCTL: PSVT2 Mask                */

#define LCD_DCTL_CTOTIME_Pos            (16)                                                /*!< LCD_T::DCTL: CTOTIME Position          */
#define LCD_DCTL_CTOTIME_Msk            (0x1ffful << LCD_DCTL_CTOTIME_Pos)                  /*!< LCD_T::DCTL: CTOTIME Mask              */

#define LCD_PKGSEL_PKG_Pos              (0)                                                 /*!< LCD_T::PKGSEL: PKG Position            */
#define LCD_PKGSEL_PKG_Msk              (0x1ul << LCD_PKGSEL_PKG_Pos)                       /*!< LCD_T::PKGSEL: PKG Mask                */

#define LCD_STS_FCEF_Pos                (0)                                                 /*!< LCD_T::STS: FCEF Position              */
#define LCD_STS_FCEF_Msk                (0x1ul << LCD_STS_FCEF_Pos)                         /*!< LCD_T::STS: FCEF Mask                  */

#define LCD_STS_FEF_Pos                 (1)                                                 /*!< LCD_T::STS: FEF Position               */
#define LCD_STS_FEF_Msk                 (0x1ul << LCD_STS_FEF_Pos)                          /*!< LCD_T::STS: FEF Mask                   */

#define LCD_STS_CTOF_Pos                (2)                                                 /*!< LCD_T::STS: CTOF Position              */
#define LCD_STS_CTOF_Msk                (0x1ul << LCD_STS_CTOF_Pos)                         /*!< LCD_T::STS: CTOF Mask                  */

#define LCD_STS_CTIME_Pos               (16)                                                /*!< LCD_T::STS: CTIME Position             */
#define LCD_STS_CTIME_Msk               (0x1ffful << LCD_STS_CTIME_Pos)                     /*!< LCD_T::STS: CTIME Mask                 */

#define LCD_INTEN_FCEIEN_Pos            (0)                                                 /*!< LCD_T::INTEN: FCEIEN Position          */
#define LCD_INTEN_FCEIEN_Msk            (0x1ul << LCD_INTEN_FCEIEN_Pos)                     /*!< LCD_T::INTEN: FCEIEN Mask              */

#define LCD_INTEN_FEIEN_Pos             (1)                                                 /*!< LCD_T::INTEN: FEIEN Position           */
#define LCD_INTEN_FEIEN_Msk             (0x1ul << LCD_INTEN_FEIEN_Pos)                      /*!< LCD_T::INTEN: FEIEN Mask               */

#define LCD_INTEN_CTOIEN_Pos            (2)                                                 /*!< LCD_T::INTEN: CYOIEN Position          */
#define LCD_INTEN_CTOIEN_Msk            (0x1ul << LCD_INTEN_CTOIEN_Pos)                     /*!< LCD_T::INTEN: CTOIEN Mask              */

