RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/lcd_reg.h
#define LCD_DATA00_DD0_Pos              (0)                                                 /*!< LCD_T::DATA00: DD0 Position            */
#define LCD_DATA00_DD0_Msk              (0xfful << LCD_DATA00_DD0_Pos)                      /*!< LCD_T::DATA00: DD0 Mask                */

#define LCD_DATA00_DD1_Pos              (8)                                                 /*!< LCD_T::DATA00: DD1 Position            */
#define LCD_DATA00_DD1_Msk              (0xfful << LCD_DATA00_DD1_Pos)                      /*!< LCD_T::DATA00: DD1 Mask                */

#define LCD_DATA00_DD2_Pos              (16)                                                /*!< LCD_T::DATA00: DD2 Position            */
#define LCD_DATA00_DD2_Msk              (0xfful << LCD_DATA00_DD2_Pos)                      /*!< LCD_T::DATA00: DD2 Mask                */

#define LCD_DATA00_DD3_Pos              (24)                                                /*!< LCD_T::DATA00: DD3 Position            */
#define LCD_DATA00_DD3_Msk              (0xfful << LCD_DATA00_DD3_Pos)                      /*!< LCD_T::DATA00: DD3 Mask                */

#define LCD_DATA01_DD0_Pos              (0)                                                 /*!< LCD_T::DATA01: DD0 Position            */
#define LCD_DATA01_DD0_Msk              (0xfful << LCD_DATA01_DD0_Pos)                      /*!< LCD_T::DATA01: DD0 Mask                */

#define LCD_DATA01_DD1_Pos              (8)                                                 /*!< LCD_T::DATA01: DD1 Position            */
#define LCD_DATA01_DD1_Msk              (0xfful << LCD_DATA01_DD1_Pos)                      /*!< LCD_T::DATA01: DD1 Mask                */

#define LCD_DATA01_DD2_Pos              (16)                                                /*!< LCD_T::DATA01: DD2 Position            */
#define LCD_DATA01_DD2_Msk              (0xfful << LCD_DATA01_DD2_Pos)                      /*!< LCD_T::DATA01: DD2 Mask                */

#define LCD_DATA01_DD3_Pos              (24)                                                /*!< LCD_T::DATA01: DD3 Position            */
#define LCD_DATA01_DD3_Msk              (0xfful << LCD_DATA01_DD3_Pos)                      /*!< LCD_T::DATA01: DD3 Mask                */

#define LCD_DATA02_DD0_Pos              (0)                                                 /*!< LCD_T::DATA02: DD0 Position            */
#define LCD_DATA02_DD0_Msk              (0xfful << LCD_DATA02_DD0_Pos)                      /*!< LCD_T::DATA02: DD0 Mask                */

#define LCD_DATA02_DD1_Pos              (8)                                                 /*!< LCD_T::DATA02: DD1 Position            */
#define LCD_DATA02_DD1_Msk              (0xfful << LCD_DATA02_DD1_Pos)                      /*!< LCD_T::DATA02: DD1 Mask                */

#define LCD_DATA02_DD2_Pos              (16)                                                /*!< LCD_T::DATA02: DD2 Position            */
#define LCD_DATA02_DD2_Msk              (0xfful << LCD_DATA02_DD2_Pos)                      /*!< LCD_T::DATA02: DD2 Mask                */

#define LCD_DATA02_DD3_Pos              (24)                                                /*!< LCD_T::DATA02: DD3 Position            */
#define LCD_DATA02_DD3_Msk              (0xfful << LCD_DATA02_DD3_Pos)                      /*!< LCD_T::DATA02: DD3 Mask                */

#define LCD_DATA03_DD0_Pos              (0)                                                 /*!< LCD_T::DATA03: DD0 Position            */
#define LCD_DATA03_DD0_Msk              (0xfful << LCD_DATA03_DD0_Pos)                      /*!< LCD_T::DATA03: DD0 Mask                */

#define LCD_DATA03_DD1_Pos              (8)                                                 /*!< LCD_T::DATA03: DD1 Position            */
#define LCD_DATA03_DD1_Msk              (0xfful << LCD_DATA03_DD1_Pos)                      /*!< LCD_T::DATA03: DD1 Mask                */

#define LCD_DATA03_DD2_Pos              (16)                                                /*!< LCD_T::DATA03: DD2 Position            */
#define LCD_DATA03_DD2_Msk              (0xfful << LCD_DATA03_DD2_Pos)                      /*!< LCD_T::DATA03: DD2 Mask                */

#define LCD_DATA03_DD3_Pos              (24)                                                /*!< LCD_T::DATA03: DD3 Position            */
#define LCD_DATA03_DD3_Msk              (0xfful << LCD_DATA03_DD3_Pos)                      /*!< LCD_T::DATA03: DD3 Mask                */

#define LCD_DATA04_DD0_Pos              (0)                                                 /*!< LCD_T::DATA04: DD0 Position            */
#define LCD_DATA04_DD0_Msk              (0xfful << LCD_DATA04_DD0_Pos)                      /*!< LCD_T::DATA04: DD0 Mask                */

#define LCD_DATA04_DD1_Pos              (8)                                                 /*!< LCD_T::DATA04: DD1 Position            */
#define LCD_DATA04_DD1_Msk              (0xfful << LCD_DATA04_DD1_Pos)                      /*!< LCD_T::DATA04: DD1 Mask                */

#define LCD_DATA04_DD2_Pos              (16)                                                /*!< LCD_T::DATA04: DD2 Position            */
#define LCD_DATA04_DD2_Msk              (0xfful << LCD_DATA04_DD2_Pos)                      /*!< LCD_T::DATA04: DD2 Mask                */

#define LCD_DATA04_DD3_Pos              (24)                                                /*!< LCD_T::DATA04: DD3 Position            */
#define LCD_DATA04_DD3_Msk              (0xfful << LCD_DATA04_DD3_Pos)                      /*!< LCD_T::DATA04: DD3 Mask                */

#define LCD_DATA05_DD0_Pos              (0)                                                 /*!< LCD_T::DATA05: DD0 Position            */
#define LCD_DATA05_DD0_Msk              (0xfful << LCD_DATA05_DD0_Pos)                      /*!< LCD_T::DATA05: DD0 Mask                */

#define LCD_DATA05_DD1_Pos              (8)                                                 /*!< LCD_T::DATA05: DD1 Position            */
#define LCD_DATA05_DD1_Msk              (0xfful << LCD_DATA05_DD1_Pos)                      /*!< LCD_T::DATA05: DD1 Mask                */

