RT-Thread/rt-thread/bsp/nuvoton/libraries/m2354/Device/Nuvoton/M2354/Include/lcd_reg.h
#define LCD_DATA05_DD2_Pos              (16)                                                /*!< LCD_T::DATA05: DD2 Position            */
#define LCD_DATA05_DD2_Msk              (0xfful << LCD_DATA05_DD2_Pos)                      /*!< LCD_T::DATA05: DD2 Mask                */

#define LCD_DATA05_DD3_Pos              (24)                                                /*!< LCD_T::DATA05: DD3 Position            */
#define LCD_DATA05_DD3_Msk              (0xfful << LCD_DATA05_DD3_Pos)                      /*!< LCD_T::DATA05: DD3 Mask                */

#define LCD_DATA06_DD0_Pos              (0)                                                 /*!< LCD_T::DATA06: DD0 Position            */
#define LCD_DATA06_DD0_Msk              (0xfful << LCD_DATA06_DD0_Pos)                      /*!< LCD_T::DATA06: DD0 Mask                */

#define LCD_DATA06_DD1_Pos              (8)                                                 /*!< LCD_T::DATA06: DD1 Position            */
#define LCD_DATA06_DD1_Msk              (0xfful << LCD_DATA06_DD1_Pos)                      /*!< LCD_T::DATA06: DD1 Mask                */

#define LCD_DATA06_DD2_Pos              (16)                                                /*!< LCD_T::DATA06: DD2 Position            */
#define LCD_DATA06_DD2_Msk              (0xfful << LCD_DATA06_DD2_Pos)                      /*!< LCD_T::DATA06: DD2 Mask                */

#define LCD_DATA06_DD3_Pos              (24)                                                /*!< LCD_T::DATA06: DD3 Position            */
#define LCD_DATA06_DD3_Msk              (0xfful << LCD_DATA06_DD3_Pos)                      /*!< LCD_T::DATA06: DD3 Mask                */

#define LCD_DATA07_DD0_Pos              (0)                                                 /*!< LCD_T::DATA07: DD0 Position            */
#define LCD_DATA07_DD0_Msk              (0xfful << LCD_DATA07_DD0_Pos)                      /*!< LCD_T::DATA07: DD0 Mask                */

#define LCD_DATA07_DD1_Pos              (8)                                                 /*!< LCD_T::DATA07: DD1 Position            */
#define LCD_DATA07_DD1_Msk              (0xfful << LCD_DATA07_DD1_Pos)                      /*!< LCD_T::DATA07: DD1 Mask                */

#define LCD_DATA07_DD2_Pos              (16)                                                /*!< LCD_T::DATA07: DD2 Position            */
#define LCD_DATA07_DD2_Msk              (0xfful << LCD_DATA07_DD2_Pos)                      /*!< LCD_T::DATA07: DD2 Mask                */

#define LCD_DATA07_DD3_Pos              (24)                                                /*!< LCD_T::DATA07: DD3 Position            */
#define LCD_DATA07_DD3_Msk              (0xfful << LCD_DATA07_DD3_Pos)                      /*!< LCD_T::DATA07: DD3 Mask                */

#define LCD_DATA08_DD0_Pos              (0)                                                 /*!< LCD_T::DATA08: DD0 Position            */
#define LCD_DATA08_DD0_Msk              (0xfful << LCD_DATA08_DD0_Pos)                      /*!< LCD_T::DATA08: DD0 Mask                */

#define LCD_DATA08_DD1_Pos              (8)                                                 /*!< LCD_T::DATA08: DD1 Position            */
#define LCD_DATA08_DD1_Msk              (0xfful << LCD_DATA08_DD1_Pos)                      /*!< LCD_T::DATA08: DD1 Mask                */

#define LCD_DATA08_DD2_Pos              (16)                                                /*!< LCD_T::DATA08: DD2 Position            */
#define LCD_DATA08_DD2_Msk              (0xfful << LCD_DATA08_DD2_Pos)                      /*!< LCD_T::DATA08: DD2 Mask                */

#define LCD_DATA08_DD3_Pos              (24)                                                /*!< LCD_T::DATA08: DD3 Position            */
#define LCD_DATA08_DD3_Msk              (0xfful << LCD_DATA08_DD3_Pos)                      /*!< LCD_T::DATA08: DD3 Mask                */

#define LCD_DATA09_DD0_Pos              (0)                                                 /*!< LCD_T::DATA09: DD0 Position            */
#define LCD_DATA09_DD0_Msk              (0xfful << LCD_DATA09_DD0_Pos)                      /*!< LCD_T::DATA09: DD0 Mask                */

#define LCD_DATA09_DD1_Pos              (8)                                                 /*!< LCD_T::DATA09: DD1 Position            */
#define LCD_DATA09_DD1_Msk              (0xfful << LCD_DATA09_DD1_Pos)                      /*!< LCD_T::DATA09: DD1 Mask                */

#define LCD_DATA09_DD2_Pos              (16)                                                /*!< LCD_T::DATA09: DD2 Position            */
#define LCD_DATA09_DD2_Msk              (0xfful << LCD_DATA09_DD2_Pos)                      /*!< LCD_T::DATA09: DD2 Mask                */

#define LCD_DATA09_DD3_Pos              (24)                                                /*!< LCD_T::DATA09: DD3 Position            */
#define LCD_DATA09_DD3_Msk              (0xfful << LCD_DATA09_DD3_Pos)                      /*!< LCD_T::DATA09: DD3 Mask                */

#define LCD_DATA10_DD0_Pos              (0)                                                 /*!< LCD_T::DATA10: DD0 Position            */
#define LCD_DATA10_DD0_Msk              (0xfful << LCD_DATA10_DD0_Pos)                      /*!< LCD_T::DATA10: DD0 Mask                */

#define LCD_DATA10_DD1_Pos              (8)                                                 /*!< LCD_T::DATA10: DD1 Position            */
#define LCD_DATA10_DD1_Msk              (0xfful << LCD_DATA10_DD1_Pos)                      /*!< LCD_T::DATA10: DD1 Mask                */

#define LCD_DATA10_DD2_Pos              (16)                                                /*!< LCD_T::DATA10: DD2 Position            */
#define LCD_DATA10_DD2_Msk              (0xfful << LCD_DATA10_DD2_Pos)                      /*!< LCD_T::DATA10: DD2 Mask                */

#define LCD_DATA10_DD3_Pos              (24)                                                /*!< LCD_T::DATA10: DD3 Position            */
#define LCD_DATA10_DD3_Msk              (0xfful << LCD_DATA10_DD3_Pos)                      /*!< LCD_T::DATA10: DD3 Mask                */

/**@}*/ /* LCD_CONST */
/**@}*/ /* end of LCD register group */
/**@}*/ /* end of REGISTER group */


#endif /* __LCD_REG_H__ */
